Revit 2027 API
BuiltInFailures.ScheduleViewFailures.NoColumnsJoinedToGridLines Property
 No columns are joined to grid lines, or view parameters exclude all columns.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoColumnsJoinedToGridLines { get; }
Public Shared ReadOnly Property NoColumnsJoinedToGridLines As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoColumnsJoinedToGridLines {
	FailureDefinitionId^ get ();
}
static member NoColumnsJoinedToGridLines : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace